chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D43.xml
        <register>
          <name>HEOCFG26</name>
          <description>High End Overlay Configuration Register 26</description>
          <addressOffset>0x000003F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI4COEFF4</name>
              <description>Horizontal Coefficient for phase 4 tap 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG27</name>
          <description>High End Overlay Configuration Register 27</description>
          <addressOffset>0x000003F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI5COEFF0</name>
              <description>Horizontal Coefficient for phase 5 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI5COEFF1</name>
              <description>Horizontal Coefficient for phase 5 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI5COEFF2</name>
              <description>Horizontal Coefficient for phase 5 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI5COEFF3</name>
              <description>Horizontal Coefficient for phase 5 tap 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG28</name>
          <description>High End Overlay Configuration Register 28</description>
          <addressOffset>0x000003FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI5COEFF4</name>
              <description>Horizontal Coefficient for phase 5 tap 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG29</name>
          <description>High End Overlay Configuration Register 29</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI6COEFF0</name>
              <description>Horizontal Coefficient for phase 6 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI6COEFF1</name>
              <description>Horizontal Coefficient for phase 6 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI6COEFF2</name>
              <description>Horizontal Coefficient for phase 6 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI6COEFF3</name>
              <description>Horizontal Coefficient for phase 6 tap 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG30</name>
          <description>High End Overlay Configuration Register 30</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI6COEFF4</name>
              <description>Horizontal Coefficient for phase 6 tap 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG31</name>
          <description>High End Overlay Configuration Register 31</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI7COEFF0</name>
              <description>Horizontal Coefficient for phase 7 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI7COEFF1</name>
              <description>Horizontal Coefficient for phase 7 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI7COEFF2</name>
              <description>Horizontal Coefficient for phase 7 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPHI7COEFF3</name>
              <description>Horizontal Coefficient for phase 7 tap 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG32</name>
          <description>High End Overlay Configuration Register 32</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHI7COEFF4</name>
              <description>Horizontal Coefficient for phase 7 tap 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG33</name>
          <description>High End Overlay Configuration Register 33</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YPHI0COEFF0</name>
              <description>Vertical Coefficient for phase 0 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI0COEFF1</name>
              <description>Vertical Coefficient for phase 0 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI0COEFF2</name>
              <description>Vertical Coefficient for phase 0 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG34</name>
          <description>High End Overlay Configuration Register 34</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YPHI1COEFF0</name>
              <description>Vertical Coefficient for phase 1 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI1COEFF1</name>
              <description>Vertical Coefficient for phase 1 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI1COEFF2</name>
              <description>Vertical Coefficient for phase 1 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG35</name>
          <description>High End Overlay Configuration Register 35</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YPHI2COEFF0</name>
              <description>Vertical Coefficient for phase 2 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI2COEFF1</name>
              <description>Vertical Coefficient for phase 2 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI2COEFF2</name>
              <description>Vertical Coefficient for phase 2 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG36</name>
          <description>High End Overlay Configuration Register 36</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YPHI3COEFF0</name>
              <description>Vertical Coefficient for phase 3 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI3COEFF1</name>
              <description>Vertical Coefficient for phase 3 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI3COEFF2</name>
              <description>Vertical Coefficient for phase 3 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG37</name>
          <description>High End Overlay Configuration Register 37</description>
          <addressOffset>0x00000420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YPHI4COEFF0</name>
              <description>Vertical Coefficient for phase 4 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI4COEFF1</name>
              <description>Vertical Coefficient for phase 4 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI4COEFF2</name>
              <description>Vertical Coefficient for phase 4 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG38</name>
          <description>High End Overlay Configuration Register 38</description>
          <addressOffset>0x00000424</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YPHI5COEFF0</name>
              <description>Vertical Coefficient for phase 5 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI5COEFF1</name>
              <description>Vertical Coefficient for phase 5 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI5COEFF2</name>
              <description>Vertical Coefficient for phase 5 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG39</name>
          <description>High End Overlay Configuration Register 39</description>
          <addressOffset>0x00000428</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YPHI6COEFF0</name>
              <description>Vertical Coefficient for phase 6 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI6COEFF1</name>
              <description>Vertical Coefficient for phase 6 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI6COEFF2</name>
              <description>Vertical Coefficient for phase 6 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG40</name>
          <description>High End Overlay Configuration Register 40</description>
          <addressOffset>0x0000042C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YPHI7COEFF0</name>
              <description>Vertical Coefficient for phase 7 tap 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI7COEFF1</name>
              <description>Vertical Coefficient for phase 7 tap 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHI7COEFF2</name>
              <description>Vertical Coefficient for phase 7 tap 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HEOCFG41</name>
          <description>High End Overlay Configuration Register 41</description>
          <addressOffset>0x00000430</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPHIDEF</name>
              <description>Horizontal Filter Phase Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YPHIDEF</name>
              <description>Vertical Filter Phase Offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-255</dimIndex>
          <name>BASECLUT[%s]</name>
          <description>Base CLUT Register</description>
          <addressOffset>0x00000600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BCLUT</name>
              <description>Blue Color Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GCLUT</name>
              <description>Green Color Entry</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCLUT</name>
              <description>Red Color Entry</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-255</dimIndex>
          <name>OVR1CLUT[%s]</name>
          <description>Overlay 1 CLUT Register</description>
          <addressOffset>0x00000A00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BCLUT</name>
              <description>Blue Color Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GCLUT</name>
              <description>Green Color Entry</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCLUT</name>
              <description>Red Color Entry</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACLUT</name>
              <description>Alpha Color Entry</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>256</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-255</dimIndex>
          <name>HEOCLUT[%s]</name>
          <description>High End Overlay CLUT Register</description>
          <addressOffset>0x00001200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BCLUT</name>
              <description>Blue Color Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GCLUT</name>
              <description>Green Color Entry</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCLUT</name>
              <description>Red Color Entry</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACLUT</name>
              <description>Alpha Color Entry</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
