chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D43.xml
        <register>
          <name>CIE0</name>
          <description>Channel Interrupt Enable Register (chid = 0)</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>BIE</name>
              <description>End of Block Interrupt Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LIE</name>
              <description>End of Linked List Interrupt Enable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DIE</name>
              <description>End of Disable Interrupt Enable Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FIE</name>
              <description>End of Flush Interrupt Enable Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RBIE</name>
              <description>Read Bus Error Interrupt Enable Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WBIE</name>
              <description>Write Bus Error Interrupt Enable Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ROIE</name>
              <description>Request Overflow Error Interrupt Enable Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CID0</name>
          <description>Channel Interrupt Disable Register (chid = 0)</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>BID</name>
              <description>End of Block Interrupt Disable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LID</name>
              <description>End of Linked List Interrupt Disable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DID</name>
              <description>End of Disable Interrupt Disable Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FID</name>
              <description>End of Flush Interrupt Disable Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RBEID</name>
              <description>Read Bus Error Interrupt Disable Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WBEID</name>
              <description>Write Bus Error Interrupt Disable Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ROID</name>
              <description>Request Overflow Error Interrupt Disable Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIM0</name>
          <description>Channel Interrupt Mask Register (chid = 0)</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIM</name>
              <description>End of Block Interrupt Mask Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LIM</name>
              <description>End of Linked List Interrupt Mask Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIM</name>
              <description>End of Disable Interrupt Mask Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIM</name>
              <description>End of Flush Interrupt Mask Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RBEIM</name>
              <description>Read Bus Error Interrupt Mask Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WBEIM</name>
              <description>Write Bus Error Interrupt Mask Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROIM</name>
              <description>Request Overflow Error Interrupt Mask Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIS0</name>
          <description>Channel Interrupt Status Register (chid = 0)</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BIS</name>
              <description>End of Block Interrupt Status Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LIS</name>
              <description>End of Linked List Interrupt Status Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS</name>
              <description>End of Disable Interrupt Status Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIS</name>
              <description>End of Flush Interrupt Status Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RBEIS</name>
              <description>Read Bus Error Interrupt Status Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WBEIS</name>
              <description>Write Bus Error Interrupt Status Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROIS</name>
              <description>Request Overflow Error Interrupt Status Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSA0</name>
          <description>Channel Source Address Register (chid = 0)</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SA</name>
              <description>Channel x Source Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDA0</name>
          <description>Channel Destination Address Register (chid = 0)</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DA</name>
              <description>Channel x Destination Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDA0</name>
          <description>Channel Next Descriptor Address Register (chid = 0)</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NDAIF</name>
              <description>Channel x Next Descriptor Interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDA</name>
              <description>Channel x Next Descriptor Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDC0</name>
          <description>Channel Next Descriptor Control Register (chid = 0)</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NDE</name>
              <description>Channel x Next Descriptor Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSCR_FETCH_DIS</name>
                  <description>Descriptor fetch is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSCR_FETCH_EN</name>
                  <description>Descriptor fetch is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NDSUP</name>
              <description>Channel x Next Descriptor Source Update</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRC_PARAMS_UNCHANGED</name>
                  <description>Source parameters remain unchanged.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_PARAMS_UPDATED</name>
                  <description>Source parameters are updated when the descriptor is retrieved.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NDDUP</name>
              <description>Channel x Next Descriptor Destination Update</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DST_PARAMS_UNCHANGED</name>
                  <description>Destination parameters remain unchanged.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DST_PARAMS_UPDATED</name>
                  <description>Destination parameters are updated when the descriptor is retrieved.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NDVIEW</name>
              <description>Channel x Next Descriptor View</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NDV0</name>
                  <description>Next Descriptor View 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NDV1</name>
                  <description>Next Descriptor View 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NDV2</name>
                  <description>Next Descriptor View 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NDV3</name>
                  <description>Next Descriptor View 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CUBC0</name>
          <description>Channel Microblock Control Register (chid = 0)</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UBLEN</name>
              <description>Channel x Microblock Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CBC0</name>
          <description>Channel Block Control Register (chid = 0)</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BLEN</name>
              <description>Channel x Block Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
