chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D43.xml
        <register>
          <name>CC4</name>
          <description>Channel Configuration Register (chid = 4)</description>
          <addressOffset>0x00000178</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TYPE</name>
              <description>Channel x Transfer Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEM_TRAN</name>
                  <description>Self-triggered mode (memory-to-memory transfer).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_TRAN</name>
                  <description>Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSIZE</name>
              <description>Channel x Memory Burst Size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>The memory burst size is set to one.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>The memory burst size is set to four.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>The memory burst size is set to eight.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN</name>
                  <description>The memory burst size is set to sixteen.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSYNC</name>
              <description>Channel x Synchronization</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER2MEM</name>
                  <description>Peripheral-to-memory transfer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEM2PER</name>
                  <description>Memory-to-peripheral transfer.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROT</name>
              <description>Channel x Protection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWR_CONNECTED</name>
                  <description>Hardware request line is connected to the peripheral request line.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWR_CONNECTED</name>
                  <description>Software request is connected to the peripheral request line.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWREQ</name>
              <description>Channel x Software Request Trigger</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWR_CONNECTED</name>
                  <description>Hardware request line is connected to the peripheral request line.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWR_CONNECTED</name>
                  <description>Software request is connected to the peripheral request line.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMSET</name>
              <description>Channel x Fill Block of Memory</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_MODE</name>
                  <description>Memset is not activated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW_MODE</name>
                  <description>Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSIZE</name>
              <description>Channel x Chunk Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHK_1</name>
                  <description>1 data transferred</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_2</name>
                  <description>2 data transferred</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_4</name>
                  <description>4 data transferred</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_8</name>
                  <description>8 data transferred</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHK_16</name>
                  <description>16 data transferred</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWIDTH</name>
              <description>Channel x Data Width</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTE</name>
                  <description>The data size is set to 8 bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALFWORD</name>
                  <description>The data size is set to 16 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD</name>
                  <description>The data size is set to 32 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DWORD</name>
                  <description>The data size is set to 64 bits</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIF</name>
              <description>Channel x Source Interface Identifier</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_IF0</name>
                  <description>The data is read through the system bus interface 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_IF1</name>
                  <description>The data is read through the system bus interface 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIF</name>
              <description>Channel x Destination Interface Identifier</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_IF0</name>
                  <description>The data is written through the system bus interface 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_IF1</name>
                  <description>The data is written though the system bus interface 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAM</name>
              <description>Channel x Source Addressing Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIXED_AM</name>
                  <description>The address remains unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCREMENTED_AM</name>
                  <description>The addressing mode is incremented (the increment size is set to the data size).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBS_AM</name>
                  <description>The microblock stride is added at the microblock boundary.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBS_DS_AM</name>
                  <description>The microblock stride is added at the microblock boundary, the data stride is added at the data boundary.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAM</name>
              <description>Channel x Destination Addressing Mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIXED_AM</name>
                  <description>The address remains unchanged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCREMENTED_AM</name>
                  <description>The addressing mode is incremented (the increment size is set to the data size).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBS_AM</name>
                  <description>The microblock stride is added at the microblock boundary.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBS_DS_AM</name>
                  <description>The microblock stride is added at the microblock boundary; the data stride is added at the data boundary.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INITD</name>
              <description>Channel Initialization Done (this bit is read-only)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IN_PROGRESS</name>
                  <description>Channel initialization is in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TERMINATED</name>
                  <description>Channel initialization is completed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDIP</name>
              <description>Read in Progress (this bit is read-only)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONE</name>
                  <description>No active read transaction on the bus.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN_PROGRESS</name>
                  <description>A read transaction is in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRIP</name>
              <description>Write in Progress (this bit is read-only)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONE</name>
                  <description>No active write transaction on the bus.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN_PROGRESS</name>
                  <description>A write transaction is in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERID</name>
              <description>Channel x Peripheral Hardware Request Line Identifier</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDS_MSP4</name>
          <description>Channel Data Stride Memory Set Pattern (chid = 4)</description>
          <addressOffset>0x0000017C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SDS_MSP</name>
              <description>Channel x Source Data stride or Memory Set Pattern</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DDS_MSP</name>
              <description>Channel x Destination Data Stride or Memory Set Pattern</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSUS4</name>
          <description>Channel Source Microblock Stride (chid = 4)</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUBS</name>
              <description>Channel x Source Microblock Stride</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDUS4</name>
          <description>Channel Destination Microblock Stride (chid = 4)</description>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DUBS</name>
              <description>Channel x Destination Microblock Stride</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIE5</name>
          <description>Channel Interrupt Enable Register (chid = 5)</description>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>BIE</name>
              <description>End of Block Interrupt Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LIE</name>
              <description>End of Linked List Interrupt Enable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DIE</name>
              <description>End of Disable Interrupt Enable Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FIE</name>
              <description>End of Flush Interrupt Enable Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RBIE</name>
              <description>Read Bus Error Interrupt Enable Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WBIE</name>
              <description>Write Bus Error Interrupt Enable Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ROIE</name>
              <description>Request Overflow Error Interrupt Enable Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CID5</name>
          <description>Channel Interrupt Disable Register (chid = 5)</description>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>BID</name>
              <description>End of Block Interrupt Disable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LID</name>
              <description>End of Linked List Interrupt Disable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DID</name>
              <description>End of Disable Interrupt Disable Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FID</name>
              <description>End of Flush Interrupt Disable Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RBEID</name>
              <description>Read Bus Error Interrupt Disable Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WBEID</name>
              <description>Write Bus Error Interrupt Disable Bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ROID</name>
              <description>Request Overflow Error Interrupt Disable Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
