chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D43.xml
        <register>
          <name>CMR3</name>
          <description>PWM Channel Mode Register (ch_num = 3)</description>
          <addressOffset>0x00000260</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRE</name>
              <description>Channel Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>Peripheral clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_2</name>
                  <description>Peripheral clock/2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_4</name>
                  <description>Peripheral clock/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_8</name>
                  <description>Peripheral clock/8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_16</name>
                  <description>Peripheral clock/16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_32</name>
                  <description>Peripheral clock/32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_64</name>
                  <description>Peripheral clock/64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_128</name>
                  <description>Peripheral clock/128</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_256</name>
                  <description>Peripheral clock/256</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_512</name>
                  <description>Peripheral clock/512</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV_1024</name>
                  <description>Peripheral clock/1024</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKA</name>
                  <description>Clock A</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKB</name>
                  <description>Clock B</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALG</name>
              <description>Channel Alignment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOL</name>
              <description>Channel Polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CES</name>
              <description>Counter Event Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDS</name>
              <description>Update Selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTE</name>
              <description>Dead-Time Generator Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTHI</name>
              <description>Dead-Time PWMHx Output Inverted</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTLI</name>
              <description>Dead-Time PWMLx Output Inverted</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDTY3</name>
          <description>PWM Channel Duty Cycle Register (ch_num = 3)</description>
          <addressOffset>0x00000264</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CDTY</name>
              <description>Channel Duty-Cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDTYUPD3</name>
          <description>PWM Channel Duty Cycle Update Register (ch_num = 3)</description>
          <addressOffset>0x00000268</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CDTYUPD</name>
              <description>Channel Duty-Cycle Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPRD3</name>
          <description>PWM Channel Period Register (ch_num = 3)</description>
          <addressOffset>0x0000026C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRD</name>
              <description>Channel Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPRDUPD3</name>
          <description>PWM Channel Period Update Register (ch_num = 3)</description>
          <addressOffset>0x00000270</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPRDUPD</name>
              <description>Channel Period Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCNT3</name>
          <description>PWM Channel Counter Register (ch_num = 3)</description>
          <addressOffset>0x00000274</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>Channel Counter Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DT3</name>
          <description>PWM Channel Dead Time Register (ch_num = 3)</description>
          <addressOffset>0x00000278</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTH</name>
              <description>Dead-Time Value for PWMHx Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTL</name>
              <description>Dead-Time Value for PWMLx Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTUPD3</name>
          <description>PWM Channel Dead Time Update Register (ch_num = 3)</description>
          <addressOffset>0x0000027C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DTHUPD</name>
              <description>Dead-Time Value Update for PWMHx Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DTLUPD</name>
              <description>Dead-Time Value Update for PWMLx Output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMUPD0</name>
          <description>PWM Channel Mode Update Register (ch_num = 0)</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPOLUP</name>
              <description>Channel Polarity Update</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPOLINVUP</name>
              <description>Channel Polarity Inversion Update</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMUPD1</name>
          <description>PWM Channel Mode Update Register (ch_num = 1)</description>
          <addressOffset>0x00000420</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPOLUP</name>
              <description>Channel Polarity Update</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPOLINVUP</name>
              <description>Channel Polarity Inversion Update</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMUPD2</name>
          <description>PWM Channel Mode Update Register (ch_num = 2)</description>
          <addressOffset>0x00000440</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPOLUP</name>
              <description>Channel Polarity Update</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPOLINVUP</name>
              <description>Channel Polarity Inversion Update</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMUPD3</name>
          <description>PWM Channel Mode Update Register (ch_num = 3)</description>
          <addressOffset>0x00000460</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPOLUP</name>
              <description>Channel Polarity Update</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPOLINVUP</name>
              <description>Channel Polarity Inversion Update</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
