chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D43.xml
        <register>
          <name>REM2_1</name>
          <description>PMECC Remainder 2 Register (sec_num = 1)</description>
          <addressOffset>0x000002F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM3_1</name>
          <description>PMECC Remainder 3 Register (sec_num = 1)</description>
          <addressOffset>0x000002FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM4_1</name>
          <description>PMECC Remainder 4 Register (sec_num = 1)</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM5_1</name>
          <description>PMECC Remainder 5 Register (sec_num = 1)</description>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM6_1</name>
          <description>PMECC Remainder 6 Register (sec_num = 1)</description>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM7_1</name>
          <description>PMECC Remainder 7 Register (sec_num = 1)</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM8_1</name>
          <description>PMECC Remainder 8 Register (sec_num = 1)</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM9_1</name>
          <description>PMECC Remainder 9 Register (sec_num = 1)</description>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM10_1</name>
          <description>PMECC Remainder 10 Register (sec_num = 1)</description>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM11_1</name>
          <description>PMECC Remainder 11 Register (sec_num = 1)</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM0_2</name>
          <description>PMECC Remainder 0 Register (sec_num = 2)</description>
          <addressOffset>0x00000330</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM1_2</name>
          <description>PMECC Remainder 1 Register (sec_num = 2)</description>
          <addressOffset>0x00000334</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM2_2</name>
          <description>PMECC Remainder 2 Register (sec_num = 2)</description>
          <addressOffset>0x00000338</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM3_2</name>
          <description>PMECC Remainder 3 Register (sec_num = 2)</description>
          <addressOffset>0x0000033C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM4_2</name>
          <description>PMECC Remainder 4 Register (sec_num = 2)</description>
          <addressOffset>0x00000340</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM5_2</name>
          <description>PMECC Remainder 5 Register (sec_num = 2)</description>
          <addressOffset>0x00000344</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM6_2</name>
          <description>PMECC Remainder 6 Register (sec_num = 2)</description>
          <addressOffset>0x00000348</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM7_2</name>
          <description>PMECC Remainder 7 Register (sec_num = 2)</description>
          <addressOffset>0x0000034C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM8_2</name>
          <description>PMECC Remainder 8 Register (sec_num = 2)</description>
          <addressOffset>0x00000350</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM9_2</name>
          <description>PMECC Remainder 9 Register (sec_num = 2)</description>
          <addressOffset>0x00000354</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM10_2</name>
          <description>PMECC Remainder 10 Register (sec_num = 2)</description>
          <addressOffset>0x00000358</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM11_2</name>
          <description>PMECC Remainder 11 Register (sec_num = 2)</description>
          <addressOffset>0x0000035C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM0_3</name>
          <description>PMECC Remainder 0 Register (sec_num = 3)</description>
          <addressOffset>0x00000370</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM1_3</name>
          <description>PMECC Remainder 1 Register (sec_num = 3)</description>
          <addressOffset>0x00000374</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM2_3</name>
          <description>PMECC Remainder 2 Register (sec_num = 3)</description>
          <addressOffset>0x00000378</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM3_3</name>
          <description>PMECC Remainder 3 Register (sec_num = 3)</description>
          <addressOffset>0x0000037C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM4_3</name>
          <description>PMECC Remainder 4 Register (sec_num = 3)</description>
          <addressOffset>0x00000380</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
