chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D43.xml
        <register>
          <name>REM8_5</name>
          <description>PMECC Remainder 8 Register (sec_num = 5)</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM9_5</name>
          <description>PMECC Remainder 9 Register (sec_num = 5)</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM10_5</name>
          <description>PMECC Remainder 10 Register (sec_num = 5)</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM11_5</name>
          <description>PMECC Remainder 11 Register (sec_num = 5)</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM0_6</name>
          <description>PMECC Remainder 0 Register (sec_num = 6)</description>
          <addressOffset>0x00000430</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM1_6</name>
          <description>PMECC Remainder 1 Register (sec_num = 6)</description>
          <addressOffset>0x00000434</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM2_6</name>
          <description>PMECC Remainder 2 Register (sec_num = 6)</description>
          <addressOffset>0x00000438</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM3_6</name>
          <description>PMECC Remainder 3 Register (sec_num = 6)</description>
          <addressOffset>0x0000043C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM4_6</name>
          <description>PMECC Remainder 4 Register (sec_num = 6)</description>
          <addressOffset>0x00000440</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM5_6</name>
          <description>PMECC Remainder 5 Register (sec_num = 6)</description>
          <addressOffset>0x00000444</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM6_6</name>
          <description>PMECC Remainder 6 Register (sec_num = 6)</description>
          <addressOffset>0x00000448</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM7_6</name>
          <description>PMECC Remainder 7 Register (sec_num = 6)</description>
          <addressOffset>0x0000044C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM8_6</name>
          <description>PMECC Remainder 8 Register (sec_num = 6)</description>
          <addressOffset>0x00000450</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM9_6</name>
          <description>PMECC Remainder 9 Register (sec_num = 6)</description>
          <addressOffset>0x00000454</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM10_6</name>
          <description>PMECC Remainder 10 Register (sec_num = 6)</description>
          <addressOffset>0x00000458</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM11_6</name>
          <description>PMECC Remainder 11 Register (sec_num = 6)</description>
          <addressOffset>0x0000045C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM0_7</name>
          <description>PMECC Remainder 0 Register (sec_num = 7)</description>
          <addressOffset>0x00000470</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM1_7</name>
          <description>PMECC Remainder 1 Register (sec_num = 7)</description>
          <addressOffset>0x00000474</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM2_7</name>
          <description>PMECC Remainder 2 Register (sec_num = 7)</description>
          <addressOffset>0x00000478</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM3_7</name>
          <description>PMECC Remainder 3 Register (sec_num = 7)</description>
          <addressOffset>0x0000047C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM4_7</name>
          <description>PMECC Remainder 4 Register (sec_num = 7)</description>
          <addressOffset>0x00000480</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM5_7</name>
          <description>PMECC Remainder 5 Register (sec_num = 7)</description>
          <addressOffset>0x00000484</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM6_7</name>
          <description>PMECC Remainder 6 Register (sec_num = 7)</description>
          <addressOffset>0x00000488</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM7_7</name>
          <description>PMECC Remainder 7 Register (sec_num = 7)</description>
          <addressOffset>0x0000048C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM8_7</name>
          <description>PMECC Remainder 8 Register (sec_num = 7)</description>
          <addressOffset>0x00000490</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM9_7</name>
          <description>PMECC Remainder 9 Register (sec_num = 7)</description>
          <addressOffset>0x00000494</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM10_7</name>
          <description>PMECC Remainder 10 Register (sec_num = 7)</description>
          <addressOffset>0x00000498</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
